Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS00/atdf/PIC32CM1216LS00100.atdf
        <module name="ADC" id="U2247" version="2.4.0">
          <instance name="ADC">
            <register-group name="ADC" name-in-module="ADC" address-space="base" offset="0x42003800"/>
            <signals>
              <signal group="AIN" index="0" function="B" pad="PA02"/>
              <signal group="AIN" index="1" function="B" pad="PA03"/>
              <signal group="AIN" index="2" function="B" pad="PA04"/>
              <signal group="AIN" index="3" function="B" pad="PA05"/>
              <signal group="AIN" index="4" function="B" pad="PA06"/>
              <signal group="AIN" index="5" function="B" pad="PA07"/>
              <signal group="AIN" index="6" function="B" pad="PA08"/>
              <signal group="AIN" index="7" function="B" pad="PA09"/>
              <signal group="AIN" index="8" function="B" pad="PA10"/>
              <signal group="AIN" index="9" function="B" pad="PA11"/>
              <signal group="AIN" index="10" function="B" pad="PB02"/>
              <signal group="AIN" index="11" function="B" pad="PB03"/>
              <signal group="AIN" index="12" function="B" pad="PB04"/>
              <signal group="AIN" index="13" function="B" pad="PB05"/>
              <signal group="AIN" index="14" function="B" pad="PB06"/>
              <signal group="AIN" index="15" function="B" pad="PB07"/>
              <signal group="AIN" index="16" function="B" pad="PB00"/>
              <signal group="AIN" index="17" function="B" pad="PB01"/>
              <signal group="AIN" index="18" function="B" pad="PB08"/>
              <signal group="AIN" index="19" function="B" pad="PB09"/>
              <signal group="AIN" index="20" function="B" pad="PC00"/>
              <signal group="AIN" index="21" function="B" pad="PC01"/>
              <signal group="AIN" index="22" function="B" pad="PC02"/>
              <signal group="AIN" index="23" function="B" pad="PC03"/>
              <signal group="VREFP" function="B" pad="PA04"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RESRDY" value="41" caption="index of DMA RESRDY trigger"/>
              <param name="EXTCHANNEL_MSB" value="23" caption="Number of external channels"/>
              <param name="GCLK_ID" value="28" caption="Index of Generic Clock"/>
              <param name="INT_CH30" value="1" caption="Select OPAMP or CTAT on Channel 30"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="ADC Master/Slave Mode"/>
              <param name="INSTANCE_ID" value="78" caption="Instance index for ADC"/>
              <param name="LOAD_CALIB" value="1" caption="CALIB register to be loaded from NVM"/>
            </parameters>
          </instance>
        </module>
        <module name="CCL" id="U2225" version="2.0.1">
          <instance name="CCL">
            <register-group name="CCL" name-in-module="CCL" address-space="base" offset="0x42004800"/>
            <signals>
              <signal group="IN" index="0" function="I" pad="PA04"/>
              <signal group="IN" index="0" function="I" pad="PA16"/>
              <signal group="IN" index="0" function="I" pad="PB22"/>
              <signal group="IN" index="1" function="I" pad="PA05"/>
              <signal group="IN" index="1" function="I" pad="PA17"/>
              <signal group="IN" index="1" function="I" pad="PB00"/>
              <signal group="IN" index="2" function="I" pad="PA06"/>
              <signal group="IN" index="2" function="I" pad="PA18"/>
              <signal group="IN" index="2" function="I" pad="PB01"/>
              <signal group="IN" index="3" function="I" pad="PA08"/>
              <signal group="IN" index="3" function="I" pad="PA30"/>
              <signal group="IN" index="4" function="I" pad="PA09"/>
              <signal group="IN" index="5" function="I" pad="PA10"/>
              <signal group="IN" index="5" function="I" pad="PA20"/>
              <signal group="IN" index="6" function="I" pad="PA22"/>
              <signal group="IN" index="6" function="I" pad="PB06"/>
              <signal group="IN" index="7" function="I" pad="PA23"/>
              <signal group="IN" index="7" function="I" pad="PB07"/>
              <signal group="IN" index="8" function="I" pad="PA24"/>
              <signal group="IN" index="8" function="I" pad="PB08"/>
              <signal group="IN" index="9" function="I" pad="PB14"/>
              <signal group="IN" index="10" function="I" pad="PB15"/>
              <signal group="IN" index="10" function="I" pad="PC20"/>
              <signal group="IN" index="11" function="I" pad="PB16"/>
              <signal group="OUT" index="0" function="I" pad="PA07"/>
              <signal group="OUT" index="0" function="I" pad="PA19"/>
              <signal group="OUT" index="0" function="I" pad="PB02"/>
              <signal group="OUT" index="0" function="I" pad="PB23"/>
              <signal group="OUT" index="1" function="I" pad="PA11"/>
              <signal group="OUT" index="1" function="I" pad="PA31"/>
              <signal group="OUT" index="2" function="I" pad="PA25"/>
              <signal group="OUT" index="2" function="I" pad="PB09"/>
              <signal group="OUT" index="3" function="I" pad="PB17"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="32" caption="GCLK index for CCL"/>
              <param name="LUT_NUM" value="4" caption="Number of LUT in a CCL"/>
              <param name="SEQ_NUM" value="2" caption="Number of SEQ in a CCL"/>
              <param name="INSTANCE_ID" value="82" caption="Instance index for CCL"/>
            </parameters>
          </instance>
        </module>
        <module name="CoreDebug" version="1.0.0">
          <instance name="CoreDebug">
            <register-group name="CoreDebug" name-in-module="CoreDebug" address-space="base" offset="0xE000EDF0"/>
          </instance>
          <instance name="CoreDebug_NS">
            <register-group name="CoreDebug_NS" name-in-module="CoreDebug" address-space="base" offset="0xE002EDF0"/>
