Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS00/atdf/PIC32CM1216LS00100.atdf
          </instance>
          <instance name="SysTick_NS">
            <register-group name="SysTick_NS" name-in-module="SysTick" address-space="base" offset="0xE002E010"/>
            <parameters>
              <param name="__SYST_NUM" value="2" caption="Number of implemented SysTick timers"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="U2249" version="3.c.0">
          <instance name="TC0">
            <register-group name="TC0" name-in-module="TC" address-space="base" offset="0x42001C00"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA22"/>
              <signal group="WO" index="0" function="E" pad="PB08"/>
              <signal group="WO" index="0" function="E" pad="PB12"/>
              <signal group="WO" index="0" function="E" pad="PA14"/>
              <signal group="WO" index="1" function="E" pad="PA23"/>
              <signal group="WO" index="1" function="E" pad="PB09"/>
              <signal group="WO" index="1" function="E" pad="PB13"/>
              <signal group="WO" index="1" function="E" pad="PA15"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="16" caption="Indexes of DMA Overflow trigger"/>
              <param name="EXT" value="1" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="23" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="71" caption="Instance index for TC0"/>
            </parameters>
          </instance>
          <instance name="TC1">
            <register-group name="TC1" name-in-module="TC" address-space="base" offset="0x42002000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA20"/>
              <signal group="WO" index="0" function="E" pad="PA24"/>
              <signal group="WO" index="0" function="E" pad="PB14"/>
              <signal group="WO" index="1" function="E" pad="PA25"/>
              <signal group="WO" index="1" function="E" pad="PB15"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="19" caption="Indexes of DMA Overflow trigger"/>
              <param name="EXT" value="1" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="23" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="72" caption="Instance index for TC1"/>
            </parameters>
          </instance>
          <instance name="TC2">
            <register-group name="TC2" name-in-module="TC" address-space="base" offset="0x42002400"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA18"/>
              <signal group="WO" index="0" function="E" pad="PB02"/>
              <signal group="WO" index="0" function="E" pad="PB16"/>
              <signal group="WO" index="0" function="E" pad="PC24"/>
              <signal group="WO" index="1" function="E" pad="PA19"/>
              <signal group="WO" index="1" function="E" pad="PB03"/>
              <signal group="WO" index="1" function="E" pad="PB17"/>
              <signal group="WO" index="1" function="E" pad="PC25"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="22" caption="Indexes of DMA Overflow trigger"/>
              <param name="EXT" value="1" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="24" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="73" caption="Instance index for TC2"/>
            </parameters>
          </instance>
        </module>
        <module name="TCC" id="U2213" version="4a0">
          <instance name="TCC0">
            <register-group name="TCC0" name-in-module="TCC" address-space="base" offset="0x42002800"/>
            <signals>
              <signal group="WO" index="0" function="J" pad="PB18"/>
              <signal group="WO" index="0" function="E" pad="PA04"/>
              <signal group="WO" index="0" function="E" pad="PA08"/>
              <signal group="WO" index="0" function="E" pad="PB30"/>
              <signal group="WO" index="1" function="J" pad="PB19"/>
              <signal group="WO" index="1" function="E" pad="PA05"/>
              <signal group="WO" index="1" function="E" pad="PA09"/>
              <signal group="WO" index="1" function="E" pad="PB31"/>
              <signal group="WO" index="2" function="J" pad="PA10"/>
              <signal group="WO" index="2" function="J" pad="PA18"/>
              <signal group="WO" index="2" function="J" pad="PB20"/>
              <signal group="WO" index="3" function="J" pad="PA11"/>
              <signal group="WO" index="3" function="J" pad="PA19"/>
              <signal group="WO" index="3" function="J" pad="PB21"/>
              <signal group="WO" index="4" function="J" pad="PA22"/>
              <signal group="WO" index="4" function="J" pad="PB16"/>
              <signal group="WO" index="4" function="J" pad="PA14"/>
              <signal group="WO" index="5" function="J" pad="PA15"/>
              <signal group="WO" index="5" function="J" pad="PA23"/>
              <signal group="WO" index="5" function="J" pad="PB17"/>
              <signal group="WO" index="6" function="J" pad="PA12"/>
              <signal group="WO" index="6" function="J" pad="PA16"/>
              <signal group="WO" index="6" function="J" pad="PA20"/>
              <signal group="WO" index="6" function="J" pad="PB12"/>
              <signal group="WO" index="7" function="J" pad="PA13"/>
              <signal group="WO" index="7" function="J" pad="PA17"/>
              <signal group="WO" index="7" function="J" pad="PA21"/>
              <signal group="WO" index="7" function="J" pad="PB13"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="4" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="25" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="25" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="8" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="74" caption="Instance index for TCC0"/>
            </parameters>
          </instance>
          <instance name="TCC1">
            <register-group name="TCC1" name-in-module="TCC" address-space="base" offset="0x42002C00"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA06"/>
              <signal group="WO" index="0" function="E" pad="PA10"/>
              <signal group="WO" index="0" function="E" pad="PA30"/>
              <signal group="WO" index="1" function="E" pad="PA07"/>
              <signal group="WO" index="1" function="E" pad="PA11"/>
              <signal group="WO" index="1" function="E" pad="PA31"/>
              <signal group="WO" index="2" function="J" pad="PA08"/>
              <signal group="WO" index="2" function="J" pad="PA24"/>
              <signal group="WO" index="2" function="J" pad="PB30"/>
              <signal group="WO" index="3" function="J" pad="PA09"/>
              <signal group="WO" index="3" function="J" pad="PA25"/>
              <signal group="WO" index="3" function="J" pad="PB31"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="30" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="0" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="25" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="0" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="4" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="0" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="75" caption="Instance index for TCC1"/>
            </parameters>
          </instance>
