Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS00/atdf/PIC32CM1216LS00100.atdf
      <value-group name="SERCOM_I2CS_CTRLB__FIFOCLR">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="TXFIFO" caption="Clear TX FIFO" value="0x1"/>
        <value name="RXFIFO" caption="Clear RX FIFO" value="0x2"/>
        <value name="BOTH" caption="Clear both TX and RF FIFOs" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLB__FIFOCLR">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="TXFIFO" caption="Clear TX FIFO" value="0x1"/>
        <value name="RXFIFO" caption="Clear RX FIFO" value="0x2"/>
        <value name="BOTH" caption="Clear both TX and RF FIFOs" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__CHSIZE">
        <value name="8_BIT" caption="8 Bits" value="0x0"/>
        <value name="9_BIT" caption="9 Bits" value="0x1"/>
        <value name="5_BIT" caption="5 Bits" value="0x5"/>
        <value name="6_BIT" caption="6 Bits" value="0x6"/>
        <value name="7_BIT" caption="7 Bits" value="0x7"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__ENC">
        <value name="DISABLE" caption="Data is not encoded" value="0x0"/>
        <value name="IRDA" caption="Data is IrDA encoded" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__FIFOCLR">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="TXFIFO" caption="Clear TX FIFO" value="0x1"/>
        <value name="RXFIFO" caption="Clear RX FIFO" value="0x2"/>
        <value name="BOTH" caption="Clear both TX and RF FIFOs" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__LINCMD">
        <value name="NONE" caption="Normal USART transmission" value="0x0"/>
        <value name="SOFTWARE_CONTROL_TRANSMIT_CMD" caption="Break field is transmitted when DATA is written" value="0x1"/>
        <value name="AUTO_TRANSMIT_CMD" caption="Break, sync and identifier are automatically transmitted when DATA is written with the identifier" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__PMODE">
        <value name="EVEN" caption="Even Parity" value="0x0"/>
        <value name="ODD" caption="Odd Parity" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__SBMODE">
        <value name="1_BIT" caption="One Stop Bit" value="0x0"/>
        <value name="2_BIT" caption="Two Stop Bits" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_I2CM_CTRLC__RXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated when DATA is present in the FIFO" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when FIFO is half-full" value="0x1"/>
        <value name="FULL" caption="Interrupt and DMA triggers are generated when FIFO is full" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_I2CM_CTRLC__TXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated as long as the FIFO is not full" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when half FIFO space is free" value="0x1"/>
        <value name="EMPTY" caption="Interrupt and DMA triggers are generated as long as the FIFO is not full" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_I2CS_CTRLC__RXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated when DATA is present in the FIFO" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when FIFO is half-full" value="0x1"/>
        <value name="FULL" caption="Interrupt and DMA triggers are generated when FIFO is full" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_I2CS_CTRLC__TXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated as long as the FIFO is not full" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when half FIFO space is free" value="0x1"/>
        <value name="EMPTY" caption="Interrupt and DMA triggers are generated as long as the FIFO is not full" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLC__RXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated when DATA is present in the FIFO" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when FIFO is half-full" value="0x1"/>
        <value name="FULL" caption="Interrupt and DMA triggers are generated when FIFO is full" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLC__TXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated as long as the FIFO is not full" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when half FIFO space is free" value="0x1"/>
        <value name="EMPTY" caption="Interrupt and DMA triggers are generated as long as the FIFO is empty" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLC__BRKLEN">
        <value name="13_BIT" caption="Break field transmission is 13 bit times" value="0x0"/>
        <value name="17_BIT" caption="Break field transmission is 17 bit times" value="0x1"/>
        <value name="21_BIT" caption="Break field transmission is 21 bit times" value="0x2"/>
        <value name="26_BIT" caption="Break field transmission is 26 bit times" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLC__DATA32B">
        <value name="0x0" caption="Reads and writes with CHSIZE" value="0x0"/>
        <value name="0x1" caption="Reads with CHSIZE, writes with 32-bit extension" value="0x1"/>
        <value name="0x2" caption="Reads with 32-bit extension, writes with CHSIZE" value="0x2"/>
        <value name="0x3" caption="Reads and writes with 32-bit extension" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLC__HDRDLY">
        <value name="DELAY0" caption="Delay between break and sync transmission is 1 bit time; Delay between sync and ID transmission is 1 bit time" value="0x0"/>
        <value name="DELAY1" caption="Delay between break and sync transmission is 4 bit time; Delay between sync and ID transmission is 4 bit time" value="0x1"/>
        <value name="DELAY2" caption="Delay between break and sync transmission is 8 bit time; Delay between sync and ID transmission is 4 bit time" value="0x2"/>
        <value name="DELAY3" caption="Delay between break and sync transmission is 14 bit time; Delay between sync and ID transmission is 4 bit time" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLC__RXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated when DATA is present in the FIFO" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when FIFO is half-full" value="0x1"/>
        <value name="FULL" caption="Interrupt and DMA triggers are generated when FIFO is full" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLC__TXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated as long as the FIFO is not full" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when half FIFO space is free" value="0x1"/>
        <value name="EMPTY" caption="Interrupt and DMA triggers are generated when the FIFO is empty" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_I2CM_STATUS__BUSSTATE">
        <value name="UNKNOWN" caption="Wait for stop or idle" value="0x0"/>
        <value name="IDLE" caption="Wait for transaction initialization" value="0x1"/>
        <value name="OWNER" caption="I2C master is the current owner of the bus" value="0x2"/>
        <value name="BUSY" caption="Some other I2C master owns the bus" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_LENGTH__LENEN">
        <value name="DISABLE" caption="Length counter is disabled" value="0x0"/>
        <value name="TX" caption="Length counter is enabled for transmit" value="0x1"/>
        <value name="RX" caption="Length counter is enabled for receive" value="0x2"/>
      </value-group>
    </module>
